cask_args appdir: "/Applications"

# Install Applications tool
tap "homebrew/cask"
brew "mas"

# iOS
mas "Xcode", id: 497799835
mas "Realm Browser", id: 1007457278

# Dev Tools
brew "mysql@5.6"
brew "mecab"
brew "mecab-ipadic"
brew "imagemagick@6", link: true
brew "jpegoptim"
brew "pngquant"
brew "phantomjs"
brew "awscli"
brew "yarn"
brew "docker-compose"
cask "docker"

# Other
mas "1Password", id: 443987910
cask "fork"
cask "atom"
cask "alfred"
cask "appcleaner"
cask "google-japanese-ime"
cask "boostnote"
cask "sequel-pro"
cask "rescuetime"
